; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	infrared3 - mode
	image5 - mode
	spectrograph4 - mode
	image1 - mode
	GroundStation4 - direction
	Star11 - direction
	Star7 - direction
	Star9 - direction
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star8 - direction
	Star10 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared3)
	(supports instrument3 image5)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star5)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star8)
	(supports instrument5 image5)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star10)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(pointing satellite1 GroundStation4)
	(have_image Phenomenon12 spectrograph0)
	(have_image Phenomenon13 image5)
	(have_image Phenomenon13 spectrograph4)
	(have_image Phenomenon14 infrared3)
	(have_image Phenomenon14 spectrograph4)
	(have_image Planet15 infrared3)
	(have_image Planet15 spectrograph0)
))

)

; plan
1. (turn_to satellite1 groundstation4 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
3. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 1 of 8
4. (turn_to satellite0 star8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star8)
   goals met: 1 of 8
5. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 1 of 8
6. (turn_to satellite0 groundstation1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 8
7. (turn_to satellite0 phenomenon13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 8
8. (take_image satellite0 phenomenon13 instrument0 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 2 of 8
9. (turn_to satellite0 groundstation1 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 8
10. (turn_to satellite0 phenomenon14 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 8
11. (take_image satellite0 phenomenon14 instrument0 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 3 of 8
12. (take_image satellite0 phenomenon14 instrument0 spectrograph4)
   added: (have_image phenomenon14 spectrograph4)
   goals met: 4 of 8
13. (turn_to satellite0 groundstation1 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 8
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 8
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 8
16. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 4 of 8
17. (turn_to satellite0 phenomenon12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 8
18. (take_image satellite0 phenomenon12 instrument1 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 5 of 8
19. (turn_to satellite1 planet15 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet15)
   goals met: 4 of 8
20. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 4 of 8
21. (take_image satellite0 planet15 instrument1 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 5 of 8
22. (turn_to satellite1 star10 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star10)
   goals met: 5 of 8
23. (calibrate satellite1 instrument5 star10)
   added: (calibrated instrument5)
   goals met: 5 of 8
24. (turn_to satellite1 groundstation4 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation4)
   goals met: 6 of 8
25. (turn_to satellite1 phenomenon13 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon13)
   goals met: 5 of 8
26. (take_image satellite1 phenomenon13 instrument5 image5)
   added: (have_image phenomenon13 image5)
   goals met: 6 of 8
27. (turn_to satellite1 groundstation4 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 groundstation4)
   goals met: 7 of 8
28. (turn_to satellite1 planet15 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet15)
   goals met: 6 of 8
29. (take_image satellite1 planet15 instrument5 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 7 of 8
30. (turn_to satellite1 groundstation4 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 groundstation4)
   goals met: 8 of 8
